[
    {
        "id": "SMD0102",
        "info": {
            "nome": "Metodologia de Pesquisa",
            "tipo": "Obrigatória",
            "carga_horaria": "64h",
            "descricao": "Fundamentos de metodologia científica. Elementos do projeto: motivação, justificativa, problema, referencial teórico, objetivo, metodologia, referências bibliográficas. Modalidades de TCC. "
        }
    },
    {
        "id": "SMD0025",
        "info": {
            "nome": "Ética e Política Autoral",
            "tipo": "Obrigatória",
            "carga_horaria": "64h",
            "descricao": " A Ética na História. A Ética e a Moral nos campos social e profissional. A Propriedade Intelectual. Códigos de Ética Profissional. Ética hacker."
        }
    },
    {
        "id": "SMD0100",
        "info": {
            "nome": "Gestão de Projetos",
            "tipo": "Obrigatória",
            "carga_horaria": "64h",
            "descricao": "Introdução a Gestão de Projetos. Características dos Projetos Multimídia. Modelos de Projetos Multimídia. Os Profissionais envolvidos em Projetos Multimídia. Gerenciamento da Equipe e cronograma."
        }
    },
    {
        "id": "SMD0101",
        "info": {
            "nome": "Projeto integrado 2",
            "tipo": "Obrigatória",
            "carga_horaria": "64h",
            "descricao": "Definição de características iniciais do produto multimídia de complexidade média ou alta. Estabelecimento de metodologia de desenvolvimento."
        }
    },
    {
        "id": "SMD0111",
        "info": {
            "nome": "PTCC",
            "tipo": "Obrigatória",
            "carga_horaria": "64h",
            "descricao": "Processo de elaboração de projetos. Roteiro: título, caracterização do problema e justificativa, objetivos, metas, metodologia, cronograma e referências bibliográficas."
        }
    },
    {
        "id": "SMD0077",
        "info": {
            "nome": "TCC",
            "tipo": "Obrigatória",
            "carga_horaria": "128h",
            "descricao": "Devido ao caráter prático do curso, o trabalho de conclusão proposto almeja o desenvolvimento, individual ou em grupo, de um produto multimídia integrado. Para o caso de desenvolvimento em grupo, cada discente deverá atuar no campo específico da sua respectiva área de concentração, contribuindo com seus conhecimentos adquiridos para a elaboração do produto."
        }
    },
    {
        "id": "SMD0103",
        "info": {
            "nome": "Seminários em Multimídia",
            "tipo": "Obrigatória",
            "carga_horaria": "64h",
            "descricao": "Eventos com convidados apresentando tendências nas áreas relacionadas a Sistemas e Mídias Digitais. Leitura e análise de artigos de congressos e publicações relacionadas com Sistemas e Mídias Digitais."
        }
    },
    {
        "id": "SMD0030",
        "info": {
            "nome": "Análise de projetos de sistemas",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Introdução à análise de sistemas. Ciclo de vida e os paradigmas de desenvolvimento de software. Metodologias de modelagem de sistemas. UML - Unified Modeling Language."
        }
    },
    {
        "id": "SMD0096",
        "info": {
            "nome": "Estrutura de Dados",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Programação C. Listas: estática, dinâmica, simplesmente encadeada, duplamente encadeada, circular etc. Fila em Estrutura Dinâmica e Estática. Pilha em estrutura dinâmica e estática. Árvores binárias e balanceadas. Algoritmos de ordenação e de busca. Complexidade. Recursividade"
        }
    },
    {
        "id": "SMD0037",
        "info": {
            "nome": "Redes de Computadores",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Introdução às redes de computadores e a Internet. Estudo aprofundado das camadas TCP/IP: Aplicação, Transporte, Rede, Enlace e Física. "
        }
    },
    {
        "id": "SMD0055",
        "info": {
            "nome": "Engenharia de Software",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Evolução, terminologia e estado da arte da Engenharia de Software. Modelos de processo de desenvolvimento. Principais modelos, metodologias, técnicas e ferramentas utilizadas na Engenharia de Software."
        }
    },
    {
        "id": "SMD0099",
        "info": {
            "nome": "Banco de Dados",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Sistemas de Banco de Dados. Modelo Entidade-Relacionamento. Modelo Relacional. Projeto de banco de dados. Linguagem SQL. Aplicações em Bancos de Dados."
        }
    },
    {
        "id": "SMD0017",
        "info": {
            "nome": "Programação Orientada a objetos",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Conceitos Básicos de Orientação a Objetos – Classes, atributos, métodos, controle de acesso a métodos (serviços) e atributos, assinatura, construtores, destrutores, gerência de memória."
        }
    },
    {
        "id": "SMD0122",
        "info": {
            "nome": "Programação para Dispositivos Móveis",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Desenvolvimento de software móvel. Fragmentação e seus desafios. Técnicas de programação para dispositivos móveis. Plataformas. Explorando novos recursos."
        }
    },
    {
        "id": "SMD0021",
        "info": {
            "nome": " Gestão de Negócios Multimídia",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Entendendo o Significado da Administração. Definindo o Negócio de Sua Empresa. Articulando Recursos e Competências. Gestão de pessoas. Gestão Operacional."
        }
    },
    {
        "id": "SMD0052",
        "info": {
            "nome": " Programação Web",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Estrutura de funcionamento da World Wide Web. Modelos de programação para web. Linguagens de script para interface de aplicações web e formulários."
        }
    },
    {
        "id": "SMD0048",
        "info": {
            "nome": "Teste de Software Aplicados",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Introdução a Testes de Software. Conceitos e Tipos de Testes de Software. Processos de Testes de Software. Testes Unitá"
        }
    },
    {
        "id": "SMD0045",
        "info": {
            "nome": "Linguagem Script",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Introdução a linguagem script. Linguagem compilada X interpretada. Prototipagem. Programação Web. Scripts para configuração e extensão de softwares. Programação em uma linguagem de programação script."
        }
    },
    {
        "id": "SMD0098",
        "info": {
            "nome": "Desenho 2",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Linguagem e criação visual. Técnicas de representação e elementos gráficos. Técnicas de desenho manual e digital. Análise e experimentação gráfica. Representação visual aplicada."
        }
    },
    {
        "id": "SMD0090",
        "info": {
            "nome": "Semiótica Aplicada",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Perspectiva histórica e contemporânea da semiótica e sua relação com as mídias digitais, com particular ênfase às teorias semióticas e à semiótica da cultura e da arte. Conceitos de signo e significação."
        }
    },
    {
        "id": "SMD0119",
        "info": {
            "nome": "TADIG",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Aprofundar o conhecimento dos alunos sobre a fundamentação de Interfaces Gráficas aplicadas a dispositivos móveis e jogos digitais. Além disso, desenvolver que no aluno uma visão crítica para o desenvolvimento de interfaces para os âmbitos anteriormente citados."
        }
    },
    {
        "id": "SMD0130",
        "info": {
            "nome": "Design Emocional",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Aprofundar o conhecimento do aluno com a aplicação prática de conceitos de cognição aplicados à interação computacional, em projetos reais. Além disso, familiarizar os alunos com os conceitos básicos acerca de tecnologias de design emocional e interações sedutoras."
        }
    },
    {
        "id": "SMD0113",
        "info": {
            "nome": "Laboratório de Criatividade",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Definições de criação, inovação e criatividade. Os processos criativos e seu uso no Design. Desenvolvimento e a aplicação prática de técnicas criativas. Bloqueios e Desbloqueadores. Técnicas de geração de ideias."
        }
    },
    {
        "id": "SMD0051",
        "info": {
            "nome": "Redação para Midias Digitais",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": " Introdução aos aspectos teóricos (com ênfase à interação e interatividade) e práticos dos diversos gêneros textuais no suporte das tecnologias digitais. O hipertexto."
        }
    },
    {
        "id": "SMD0117",
        "info": {
            "nome": "Interação humano computador 2",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "-"
        }
    },
    {
        "id": "SMD0056",
        "info": {
            "nome": "Direção de Arte",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Metodologias de desenvolvimento de produtos multimídia. Geração de produtos específicos: infográfico, página web, hot-site, CD-ROM multimídia, DVD, jogos, quadrinhos e outros."
        }
    },
    {
        "id": "SMD0118",
        "info": {
            "nome": "Teoria e Crítica de Design",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Aprofundar o conhecimento dos alunos sobre a fundamentação de Design aplicado a diversas esferas da sociedade. Além disso, desejamos que o aluno desenvolva uma visão crítica do processo de design e do produto gerado, de acordo com os diferentes âmbitos estudados."
        }
    },
    {
        "id": "SMD0110",
        "info": {
            "nome": "Comunicação Visual 2",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": " Construção do significado. Gestalt aplicada à programação visual. Uso da cor e harmonias cromáticas.Criatividade.Sistemas de identidade visual."
        }
    },
    {
        "id": "SMD0053",
        "info": {
            "nome": "Programação para jogos",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Representação de personagens, cenários e objetos. Animação. Inclusão de som e música. Técnicas de Scrolling. Detecção de colisão. Motores gráficos: estrutura e conceitos."
        }
    },
    {
        "id": "SMD0023",
        "info": {
            "nome": "Design de Jogos",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "O que é design de jogos. Gêneros. A experiência do jogo. Estrutura de um jogo. Elementos de um jogo. Interação. Análise do jogador. Mecânicas de um jogo. Interfaces de jogos. Temas."
        }
    },
    {
        "id": "SMD0057",
        "info": {
            "nome": "Conc. De Cenários e Personagens",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Descrição: Projetos de ambientação. Design de cenários e caracterização de personagens. Atividades baseadas na interpretação de roteiros, de orientações de direção, pesquisas históricas e culturais."
        }
    },
    {
        "id": "SMD0035",
        "info": {
            "nome": "Matemática e Fisica para jogos",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Representação numérica. Sistemas de coordenadas. Vetores. Matrizes. Quatérnios. Elementos geométricos. Transformações geométricas. Curvas e superfícies"
        }
    },
    {
        "id": "SMD0048",
        "info": {
            "nome": "Teste de Software",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": " Introdução a Testes de Software. Conceitos e Tipos de Testes de Software. Processos de Testes de Software. Testes Unitários. TDD."
        }
    },
    {
        "id": "SMD0039",
        "info": {
            "nome": "Cultura de jogos",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Definição e conceituação de jogos eletrônicos. Narratologia e Ludologia. História dos Jogos eletrônicos. Plataformas e dispositivos. Influências dos jogos na cultura contemporânea"
        }
    },
    {
        "id": "SMD0054",
        "info": {
            "nome": "IA para Jogos",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "O que é inteligência computacional. Inteligência computacional e os jogos. Interação e comportamento. Técnicas de movimentação e predição de movimento. Mecanismos de percepção."
        }
    },
    {
        "id": "SMD0034",
        "info": {
            "nome": "Modelagem 3D",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Primitivas gráficas tridimensionais. Modelagem por sobreposição de elementos. Técnicas específicas de modelagem. Modelagem por aplicação de modificadores"
        }
    },
    {
        "id": "SMD0016",
        "info": {
            "nome": "Linguagem Audiovisual",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Técnicas de produção de áudio e de vídeo. Movimentos de câmera. Enquadramentos. Análise técnica. O papel do som: ruído, trilha, voz e efeitos. Sonorização. Linguagem: linear e não-linea"
        }
    },
    {
        "id": "SMD0129",
        "info": {
            "nome": "Tec. de Animação 2D",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "História da animação. Introdução ao universo da animação. Estudo específico das técnicas, procedimentos. Princípios e técnicas da animação clássica: teoria e prática."
        }
    },
    {
        "id": "SMD0071",
        "info": {
            "nome": "Videografismo",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Compreender os conceitos de imagem e fotografia, conhecendo e explorando as potencialidades artísticas e documentais da captura de imagens digitais, a partir do domínio técnico da câmera digital e do conhecimento dos gêneros, práticas e experimentos na produção contemporânea das imagens."
        }
    },
    {
        "id": "SMD0032",
        "info": {
            "nome": "Design de Som",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "O universo sonoro e a estética do som. Fundamentos de composição musical. Estilos musicais e suas perspectivas midiáticas. Uso narrativo da trilha sonora e de efeitos sonoros em projetos multimídia."
        }
    },
    {
        "id": "SMD0086",
        "info": {
            "nome": "Fotografia Digital.",
            "tipo": "Eletiva",
            "carga_horaria": "64h",
            "descricao": "Compreender os conceitos de imagem e fotografia, conhecendo e explorando as potencialidades artísticas e documentais da captura de imagens digitais, a partir do domínio técnico da câmera digital e do conhecimento dos gêneros, práticas e experimentos na produção contemporânea das imagens."
        }
    },
    {
        "id": "SMD0020",
        "info": {
            "nome": "Prot. de jogos tridimensionais",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "Conceitos de Jogos Digitais 3D. Introdução a modelagem tridimensional. Bases de texturas e iluminação para jogos tridimensionais. Fundamentos de animação 3D. Programação visual de jogos tridimensionais"
        }
    },
    {
        "id": "SMD0124",
        "info": {
            "nome": "PACA",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "N/a"
        }
    },
    {
        "id": "SMD0128",
        "info": {
            "nome": "Tec. de Animação 3D",
            "tipo": "Optativa",
            "carga_horaria": "64h",
            "descricao": "N/a"
        }
    }
]